{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "bottom" : "keras_layer_input",
      "alpha" : 2,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Mul",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Mul",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Mul",
      "beta" : 0
    },
    {
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub\/y",
      "w" : 1,
      "h" : 1,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub\/y",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub\/y",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub\/y",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "top" : "_neg_y_sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "type" : "activation",
      "name" : "_neg_y_sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Mul,_neg_y_sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "beta" : 0
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/hub_input\/Sub",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "transpose_161",
      "top" : "transpose_161",
      "type" : "transpose",
      "name" : "transpose_161"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_relu__",
      "blob_weights" : 5,
      "K" : 3,
      "blob_biases" : 3,
      "stride_x" : 2,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transpose_161",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_relu__",
      "blob_weights" : 9,
      "K" : 32,
      "blob_biases" : 7,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/Conv\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "blob_weights" : 13,
      "K" : 32,
      "blob_biases" : 11,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/depthwise\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_relu__",
      "blob_weights" : 17,
      "K" : 16,
      "blob_biases" : 15,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_relu__",
      "blob_weights" : 21,
      "K" : 96,
      "blob_biases" : 19,
      "stride_x" : 2,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/expand\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "blob_weights" : 25,
      "K" : 96,
      "blob_biases" : 23,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/depthwise\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_relu__",
      "blob_weights" : 29,
      "K" : 24,
      "blob_biases" : 27,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_relu__",
      "blob_weights" : 33,
      "K" : 144,
      "blob_biases" : 31,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/expand\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "blob_weights" : 37,
      "K" : 144,
      "blob_biases" : 35,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/depthwise\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/project\/BatchNorm\/FusedBatchNorm_nchw,sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_1\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/add",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/add",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_relu__",
      "blob_weights" : 41,
      "K" : 24,
      "blob_biases" : 39,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_2\/add",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_relu__",
      "blob_weights" : 45,
      "K" : 144,
      "blob_biases" : 43,
      "stride_x" : 2,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/expand\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "blob_weights" : 49,
      "K" : 144,
      "blob_biases" : 47,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/depthwise\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_relu__",
      "blob_weights" : 53,
      "K" : 32,
      "blob_biases" : 51,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_relu__",
      "blob_weights" : 57,
      "K" : 192,
      "blob_biases" : 55,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 192,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/expand\/Relu6",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_relu__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_neg__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_neg__",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_neg__",
      "beta" : 0
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_neg__",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_threshold6__",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_threshold6__",
      "type" : "elementwise",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_threshold6__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6__relu6_threshold6__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6",
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6",
      "type" : "activation",
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "blob_weights" : 61,
      "K" : 192,
      "blob_biases" : 59,
      "name" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/depthwise\/Relu6",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_4\/project\/BatchNorm\/FusedBatchNorm_nchw,sequential\/keras_layer\/StatefulPartitionedCall\/StatefulPartitionedCall\/StatefulPartitionedCall\/predict\/MobilenetV2\/expanded_conv_3\/project\/BatchNorm\/FusedBatchNorm_nchw",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
